Repository: sarperarikan/wcag-analyst-nvda-addon
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: tr

source: Connection error (attempt {attempt}/{max}): {error}
tr: Bağlantı hatası (deneme {attempt}/{max}): {error}

source: API error: {error}
tr: API hatası: {error}

source: Unknown error
tr: Bilinmeyen hata

source: --- Code Start ---
tr: --- Kod Başlangıcı ---

source: --- Code End ---
tr: --- Kod Bitişi ---

source: WCAG Reporter - Analysis Result
tr: WCAG Reporter - Analiz Sonucu

source: Ask more questions...
tr: Daha fazla soru sor...

source: Ask follow-up question...
tr: Takip sorusu sor...

source: &Ask
tr: &Sor

source: &Copy
tr: &Kopyala

source: C&lose
tr: &Kapat

source: Copied to clipboard
tr: Panoya kopyalandı

source: Waiting for response...
tr: Yanıt bekleniyor...

source: --- Question: {question} ---
tr: --- Soru: {question} ---

source: Response ready
tr: Yanıt hazır

source: Error: {error}
tr: Hata: {error}

source: WCAG Analyst - HTML Analysis
tr: WCAG Analyst - HTML Analizi

source: &HTML Content:
tr: &HTML İçeriği:

source: Paste the HTML content to analyze here...
tr: Analiz edilecek HTML içeriğini buraya yapıştırın...

source: &Analyze
tr: &Analiz Et

source: I&mprovements and Suggestions:
tr: İ&yileştirmeler ve Öneriler:

source: Enter HTML content and click 'Analyze' button.
tr: HTML içeriğini girin ve 'Analiz Et' butonuna tıklayın.

source: Ask &More:
tr: Daha Fazla &Sorun:

source: Ask additional questions about WCAG...
tr: WCAG hakkında ek soru sorun...

source: Ask follow-up question about WCAG...
tr: WCAG hakkında takip sorusu sor...

source: Cl&ose
tr: Ka&pat

source: Please enter HTML content first.
tr: Lütfen önce HTML içeriği girin.

source: Analysis in progress, please wait.
tr: Analiz devam ediyor, lütfen bekleyin.

source: Analyzing, please wait...
tr: Analiz yapılıyor, lütfen bekleyin...

source: Starting WCAG analysis...
tr: WCAG analizi başlıyor...

source: HTML entered by user
tr: Kullanıcı tarafından girilen HTML

source: Analysis complete.
tr: Analiz tamamlandı.

source: Please enter a question.
tr: Lütfen bir soru girin.

source: You must analyze first.
tr: Önce bir analiz yapmalısınız.

source: Operation in progress, please wait.
tr: İşlem devam ediyor, lütfen bekleyin.

source: Sending question...
tr: Soru gönderiliyor...

source: Response ready.
tr: Yanıt hazır.

source: &Refresh Models
tr: &Modelleri Yenile

source: WCAG &Version:
tr: WCAG &Sürümü:

source: &Level:
tr: &Seviye:

source: Turkish
tr: Türkçe

source: English
tr: İngilizce

source: &Language:
tr: &Dil:

source: &Timeout (sec):
tr: &Zaman Aşımı (sn):

source: (No model found)
tr: (Model bulunamadı)

source: Model list refreshed.
tr: Model listesi yenilendi.

source: WCAG Analyst
tr: WCAG Analizcisi

source: &HTML Analyst
tr: &HTML Analizcisi

source: Analyze HTML content for WCAG
tr: HTML içeriğini WCAG için analiz et

source: &Element Analysis (NVDA+Shift+W)
tr: &Element Analizi (NVDA+Shift+W)

source: Analyze focused element for WCAG
tr: Odaktaki elementi WCAG için analiz et

source: &Settings
tr: &Ayarlar

source: Open WCAG Analyst settings
tr: WCAG Analizcisi ayarlarını aç

source: &Documentation
tr: &Dokümantasyon

source: View documentation
tr: Dokümantasyonu görüntüle

source: Documentation file not found.
tr: Dokümantasyon dosyası bulunamadı.

source: Error opening documentation: {error}
tr: Dokümantasyon açılırken hata: {error}

source: No element is currently focused.
tr: Üzerinde bulunulan element yok.

source: Could not extract element information.
tr: Element bilgisi alınamadı.

source: Starting WCAG analysis... 0 percent
tr: WCAG analizi başlıyor... Yüzde 0

source: Extracting element info... 10 percent
tr: Element bilgisi çıkarılıyor... Yüzde 10

source: Connecting to Ollama server... 30 percent
tr: Ollama sunucusuna bağlanılıyor... Yüzde 30

source: Processing response... 90 percent
tr: Yanıt işleniyor... Yüzde 90

source: <!-- Element Info -->
tr: <!-- Element Bilgisi -->

source: <!-- Role: {role} -->
tr: <!-- Rol: {role} -->

source: <!-- States: {states} -->
tr: <!-- Durumlar: {states} -->

source: <!-- Child element count: {count} -->
tr: <!-- Alt element sayısı: {count} -->

source: <element>Unknown element</element>
tr: <element>Bilinmeyen element</element>

source: Role: {role}
tr: Rol: {role}

source: Web page (Browse Mode)
tr: Web sayfası (Browse Mode)

source: Parent element: {name}
tr: Üst element: {name}

source: Unknown
tr: Bilinmiyor

source: WCAG Reporter Error
tr: WCAG Reporter Hatası

source: An error occurred during analysis: {error}
tr: WCAG analizi sırasında hata oluştu: {error}
